share/tutorials/heat-transfer/buoyant-simple/buoyant_cavity/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 4e-06;

boundaryField
{
  frontAndBack
  {
    type            epsilonWallFunction;
    value           uniform 4e-06;
  }
  topAndBottom
  {
    type            epsilonWallFunction;
    value           uniform 4e-06;
  }
  hot
  {
    type            epsilonWallFunction;
    value           uniform 4e-06;
  }
  cold
  {
    type            epsilonWallFunction;
    value           uniform 4e-06;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
