share/tutorials/heat-transfer/buoyant-simple/buoyant_cavity/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 3.75e-04;

boundaryField
{
  frontAndBack
  {
    type            kqRWallFunction;
    value           uniform 3.75e-04;
  }
  topAndBottom
  {
    type            kqRWallFunction;
    value           uniform 3.75e-04;
  }
  hot
  {
    type            kqRWallFunction;
    value           uniform 3.75e-04;
  }
  cold
  {
    type            kqRWallFunction;
    value           uniform 3.75e-04;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
