share/tutorials/heat-transfer/buoyant-simple/buoyant_cavity/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSchemes;
}

ddtSchemes
{
  default steadyState;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss limitedLinear 0.2;
  div(phi,K)      bounded Gauss limitedLinear 0.2;
  div(phi,h)      bounded Gauss limitedLinear 0.2;
  div(phi,k)      bounded Gauss limitedLinear 0.2;
  div(phi,epsilon) bounded Gauss limitedLinear 0.2;
  div(phi,omega) bounded Gauss limitedLinear 0.2;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear orthogonal;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         orthogonal;
}
wallDist
{
  method meshWave;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
